{
  "categories": [
    {
      "id": "1",
      "name": "Classic Literature"
    },
    {
      "id": "2",
      "name": "Science Fiction"
    },
    {
      "id": "3",
      "name": "Fantasy"
    },
    {
      "id": "4",
      "name": "Mystery"
    },
    {
      "id": "5",
      "name": "Historical Fiction"
    },
    {
      "id": "6",
      "name": "Adventure"
    },
    {
      "id": "7",
      "name": "Horror"
    },
    {
      "id": "8",
      "name": "Philosophical Fiction"
    }
  ],
  "posts": [
    {
      "id": "1",
      "title": "Pride and Prejudice",
      "categoryId": "1",
      "content": "Một tác phẩm kinh điển của Jane Austen kể về câu chuyện tình yêu giữa Elizabeth Bennet và Mr. Darcy trong xã hội Anh thế kỷ 19. Với sự châm biếm tinh tế và những nhân vật sâu sắc, cuốn tiểu thuyết khám phá những định kiến về tầng lớp và hôn nhân.",
      "slug": "pride-and-prejudice",
      "updatedAt": "2025-03-03T03:18:46.673Z"
    },
    {
      "id": "2",
      "title": "1984",
      "categoryId": "2",
      "content": "George Orwell mô tả một thế giới tương lai u ám, nơi chính phủ toàn trị giám sát từng hành động và tư tưởng của công dân. Nhân vật chính, Winston Smith, đấu tranh chống lại hệ thống đàn áp và tuyên truyền của Đảng, trong một câu chuyện đầy ám ảnh về quyền lực và tự do.",
      "slug": "1984",
      "updatedAt": "2025-02-18T15:45:00.000Z"
    },
    {
      "id": "3",
      "title": "The Lord of the Rings",
      "categoryId": "3",
      "content": "J.R.R. Tolkien vẽ nên một thế giới giả tưởng đầy huyền bí với các chủng tộc như tiên, người lùn, phù thủy và quái vật. Chuyến hành trình của Frodo Baggins nhằm tiêu hủy Chiếc Nhẫn Quyền Lực chính là một trong những câu chuyện sử thi vĩ đại nhất của văn học thế giới.",
      "slug": "the-lord-of-the-rings",
      "updatedAt": "2025-02-24T10:08:48.010Z"
    },
    {
      "id": "4",
      "title": "The Hound of the Baskervilles",
      "categoryId": "4",
      "content": "Sherlock Holmes và bác sĩ Watson phải đối mặt với một vụ án kỳ bí liên quan đến một lời nguyền gia đình và một con chó ma quái. Với những tình tiết hấp dẫn, cuốn tiểu thuyết này là một trong những tác phẩm trinh thám nổi bật nhất của Arthur Conan Doyle.",
      "slug": "hound-of-the-baskervilles",
      "updatedAt": "2025-02-25T01:25:43.960Z"
    },
    {
      "id": "5",
      "title": "War and Peace",
      "categoryId": "5",
      "content": "Leo Tolstoy khắc họa bức tranh hoành tráng về cuộc sống của tầng lớp quý tộc Nga trong bối cảnh chiến tranh Napoleon. Cuốn tiểu thuyết kết hợp những phân tích tâm lý sâu sắc với những trận chiến lịch sử hào hùng.",
      "slug": "war-and-peace",
      "updatedAt": "2025-02-25T13:45:00.000Z"
    },
    {
      "id": "6",
      "title": "Moby-Dick",
      "categoryId": "6",
      "content": "Cuộc hành trình đầy ám ảnh của thuyền trưởng Ahab khi săn đuổi con cá voi trắng Moby Dick. Herman Melville đã tạo ra một câu chuyện sâu sắc về sự ám ảnh, thù hận và số phận con người.",
      "slug": "moby-dick",
      "updatedAt": "2025-03-01T10:00:00.000Z"
    },
    {
      "id": "7",
      "title": "Brave New World",
      "categoryId": "2",
      "content": "Aldous Huxley miêu tả một xã hội tương lai nơi con người bị kiểm soát bởi công nghệ và thuốc men, đánh mất sự tự do và ý nghĩa cuộc sống. Một tác phẩm viễn tưởng có sức ảnh hưởng lớn về triết lý và đạo đức.",
      "slug": "brave-new-world",
      "updatedAt": "2025-03-02T08:30:00.000Z"
    },
    {
      "id": "8",
      "title": "Dracula",
      "categoryId": "7",
      "content": "Bram Stoker giới thiệu hình tượng ma cà rồng kinh điển với Bá tước Dracula, một sinh vật bóng tối hút máu người và gieo rắc nỗi sợ hãi trên khắp châu Âu.",
      "slug": "dracula",
      "updatedAt": "2025-02-27T12:00:00.000Z"
    },
    {
      "id": "9",
      "title": "Frankenstein",
      "categoryId": "7",
      "content": "Một câu chuyện đầy bi kịch về sự sáng tạo và trách nhiệm. Victor Frankenstein tạo ra một sinh vật từ xác người chết, nhưng chính sự chối bỏ của xã hội đã biến nó thành một con quái vật thực sự.",
      "slug": "frankenstein",
      "updatedAt": "2025-02-28T14:15:00.000Z"
    },
    {
      "id": "10",
      "title": "The Great Gatsby",
      "categoryId": "1",
      "content": "F. Scott Fitzgerald mô tả xã hội Mỹ trong thập niên 1920, nơi những giấc mơ xa hoa bị che phủ bởi sự giả tạo và bi kịch. Jay Gatsby, một triệu phú bí ẩn, theo đuổi tình yêu với Daisy Buchanan trong một câu chuyện đầy cảm xúc.",
      "slug": "the-great-gatsby",
      "updatedAt": "2025-02-22T19:45:00.000Z"
    },
    {
      "id": "11",
      "title": "To Kill a Mockingbird",
      "categoryId": "1",
      "content": "Harper Lee đã tạo nên một câu chuyện sâu sắc về nạn phân biệt chủng tộc ở miền Nam nước Mỹ. Nhân vật Atticus Finch, một luật sư chính trực, bảo vệ một người đàn ông da đen bị buộc tội oan trong bối cảnh đầy định kiến và bất công.",
      "slug": "to-kill-a-mockingbird",
      "updatedAt": "2025-03-04T10:00:00.000Z"
    },
    {
      "id": "12",
      "title": "The Catcher in the Rye",
      "categoryId": "1",
      "content": "J.D. Salinger kể về hành trình nổi loạn của chàng trai trẻ Holden Caulfield khi anh ta chán nản với thế giới giả dối của người lớn. Một tiểu thuyết về tuổi trẻ, sự cô đơn và những mâu thuẫn nội tâm.",
      "slug": "the-catcher-in-the-rye",
      "updatedAt": "2025-03-04T11:30:00.000Z"
    },
    {
      "id": "13",
      "title": "The Picture of Dorian Gray",
      "categoryId": "8",
      "content": "Oscar Wilde viết về một chàng trai trẻ tên Dorian Gray, người có một bức tranh chân dung già đi thay cho chính mình. Tiểu thuyết phản ánh sự đồi trụy và ám ảnh của con người với cái đẹp và tuổi trẻ.",
      "slug": "the-picture-of-dorian-gray",
      "updatedAt": "2025-03-04T13:00:00.000Z"
    },
    {
      "id": "14",
      "title": "Crime and Punishment",
      "categoryId": "8",
      "content": "Fyodor Dostoevsky khám phá tâm lý tội phạm thông qua nhân vật Raskolnikov, một sinh viên nghèo giết người để thử nghiệm lý thuyết của mình về đạo đức. Cuốn tiểu thuyết là một kiệt tác về tâm lý và sự chuộc lỗi.",
      "slug": "crime-and-punishment",
      "updatedAt": "2025-03-04T14:30:00.000Z"
    },
    {
      "id": "15",
      "title": "Les Misérables",
      "categoryId": "5",
      "content": "Victor Hugo kể về cuộc đời đầy thăng trầm của Jean Valjean, một người từng là tù nhân nhưng cố gắng chuộc lỗi và làm lại cuộc đời. Cuốn sách mang đến những góc nhìn về công lý, tình yêu và lòng nhân đạo.",
      "slug": "les-miserables",
      "updatedAt": "2025-03-04T16:00:00.000Z"
    },
    {
      "id": "16",
      "title": "The Count of Monte Cristo",
      "categoryId": "6",
      "content": "Alexandre Dumas kể về hành trình báo thù của Edmond Dantès, người bị phản bội và bị giam cầm trong nhiều năm. Với sự thông minh và lòng kiên trì, anh lên kế hoạch phục hận trong một câu chuyện đầy kịch tính.",
      "slug": "the-count-of-monte-cristo",
      "updatedAt": "2025-03-04T17:30:00.000Z"
    },
    {
      "id": "17",
      "title": "Fahrenheit 451",
      "categoryId": "2",
      "content": "Ray Bradbury miêu tả một xã hội nơi việc đọc sách bị cấm và lính cứu hỏa có nhiệm vụ đốt sách. Nhân vật chính, Guy Montag, dần thức tỉnh và nổi dậy chống lại hệ thống đàn áp này.",
      "slug": "fahrenheit-451",
      "updatedAt": "2025-03-04T19:00:00.000Z"
    },
    {
      "id": "18",
      "title": "The Hobbit",
      "categoryId": "3",
      "content": "J.R.R. Tolkien kể về hành trình của Bilbo Baggins, một hobbit bị kéo vào cuộc phiêu lưu cùng những người lùn để giành lại kho báu từ con rồng Smaug. Một câu chuyện phiêu lưu hấp dẫn dành cho mọi lứa tuổi.",
      "slug": "the-hobbit",
      "updatedAt": "2025-03-04T20:30:00.000Z"
    },
    {
      "id": "19",
      "title": "The Brothers Karamazov",
      "categoryId": "8",
      "content": "Một kiệt tác triết học của Dostoevsky, kể về những xung đột gia đình, tôn giáo, và đạo đức giữa ba anh em nhà Karamazov. Cuốn sách đào sâu vào bản chất con người và những câu hỏi về đức tin.",
      "slug": "the-brothers-karamazov",
      "updatedAt": "2025-03-04T22:00:00.000Z"
    },
    {
      "id": "20",
      "title": "One Hundred Years of Solitude",
      "categoryId": "5",
      "content": "Gabriel García Márquez dựng lên câu chuyện huyền ảo về dòng họ Buendía trong ngôi làng Macondo. Một cuốn tiểu thuyết đầy chất hiện thực kỳ ảo và những thông điệp về lịch sử và số phận con người.",
      "slug": "one-hundred-years-of-solitude",
      "updatedAt": "2025-03-04T23:30:00.000Z"
    }
  ]
}